# -*- coding: UTF-8 -*-
import urllib.request
import urllib.parse
from py2neo import Graph

class driver:
    '''根据url，请求html'''
    def get_html(self, url):
        headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) '
                                 'Chrome/51.0.2704.63 Safari/537.36'}
        req = urllib.request.Request(url=url, headers=headers)
        res = urllib.request.urlopen(req)
        html = res.read()
        return html

    def __init__(self):
        self.g = Graph(
            host="120.77.220.71",  # shenzhen
            # host="35.236.82.226",  # losangel
            # host="34.92.13.105", # hongkong
            # host="35.236.82.226",  # taiwan
            http_port=7474,
            user="neo4j",
            password="302899")



import random
dataset = [i['n.name'] for i in driver().g.run("match (n:Disease) return n.name").data()]

real_target = []
# for i in range(1000):
#     entity = target[random.randint(0,len(target)-1)]
#     real_target.append(entity)

print(real_target)

dataset = ['成人呼吸窘迫综合征', '肺念珠菌病', '肺炎性假瘤', '农药中毒', '肺炎性假瘤', '镉中毒', '呼吸性细支气管相关的间质性肺疾病', '镉中毒', '农药中毒', '肺炎球菌肺炎', '农药中毒', '呼吸衰竭', '尼曼－匹克氏病', '成人呼吸窘迫综合征', '肺炎', '肺泡蛋白质沉积症', '肺炎性假瘤', '呼吸性细支气管相关的间质性肺疾病', '苯中毒', '肺脓肿', '过敏性休克', '肺-胸膜阿米巴病', '肺炎球菌肺炎', '减压病', '过敏性肺炎', '感冒', '肺念珠菌病', '感染性休克', '肺癌', '肺-胸膜阿米巴病', '镉中毒', '喘息样支气管炎', '肺炎杆菌肺炎', '肺转移瘤', '感染性休克', '肺水肿', '肺大泡', '尼曼－匹克氏病', '过敏性肺炎', '过敏性肺炎', '肺炎球菌肺炎', '感冒', '肺气肿', '大叶性肺炎', '肺癌', '肺念珠菌病', '二硫化碳中毒', '呼吸衰竭', '肺气肿', '成人呼吸窘迫综合征', '呼吸性细支气管相关的间质性肺疾病', '汞中毒', '镉中毒', '肺放线菌病', '减压病', '肺癌', '减压病', '肺放线菌病', '肺大疱', '肺癌', '肺栓塞', '粘连性肠梗阻', '肺炎性假瘤', '肺脓肿', '肺放线菌病', '喘息样支气管炎', '百日咳', '肺大泡', '肺气肿', '肺癌', '肺炎', '肺隐球菌病', '农药中毒', '大量羊水吸入', '肺出血－肾炎综合征', '成人呼吸窘迫综合征', '成人呼吸窘迫综合征', '放射性肺炎', '放射性肺炎', '过敏性休克', '肺放线菌病', '肺炎', '过敏性肺炎', '肺炎', '减压病', '肺曲菌病', '呼吸衰竭', '大楼病综合征', '肺大泡', '肺炎杆菌肺炎', '肺放线菌病', '急性呼吸衰竭', '肺水肿', '减压病', '减压病', '镉中毒', '过敏性肺炎', '肺泡蛋白质沉积症', '肺大疱', '肺隐球菌病', '肺-胸膜阿米巴病', '肺炎杆菌肺炎', '肺炎性假瘤', '肺曲菌病', '肺念珠菌病', '汞中毒', '呼吸性细支气管相关的间质性肺疾病', '肺脓肿', '二硫化碳中毒', '肺念珠菌病', '汞中毒', '镉中毒', '肺-胸膜阿米巴病', '肺大疱', '肺大泡', '大楼病综合征', '成人呼吸窘迫综合征', '汞中毒', '呼吸道合胞病毒肺炎', '肺出血－肾炎综合征', '肺出血－肾炎综合征', '减压病', '镉中毒', '浓缩胆汁综合征', '农药中毒', '肺炎杆菌肺炎', '过敏性休克', '诺沃克类病毒胃肠炎', '呼吸性细支气管相关的间质性肺疾病', '感冒', '汞中毒', '肺栓塞', '苯中毒', '肺泡蛋白沉着症', '肺隐球菌病', '大叶性肺炎', 'Goodpasture综合征', '肺曲菌病', 'Goodpasture综合征', '镉中毒', '感冒', '肺出血－肾炎综合征', '肺曲菌病', '肺隐球菌病', '诺沃克类病毒胃肠炎', '喘息样支气管炎', '肺放线菌病', '肺气肿', '单纯性肺嗜酸粒细胞浸润症', '农药中毒', '肺泡蛋白沉着症', '尼曼－匹克氏病', '浓缩胆汁综合征', '肺气肿', '汞中毒', '单纯性肺嗜酸粒细胞浸润症', '肺炎杆菌肺炎', '镉中毒', '成人呼吸窘迫综合征', '汞中毒', '肺大疱', '肺-胸膜阿米巴病', '大叶性肺炎', '百日咳', '肺炎', '百日咳', '过敏性休克', '肺炎杆菌肺炎', '过敏性肺炎', '尼曼－匹克氏病', '呼吸性细支气管相关的间质性肺疾病', '脑肝肾综合征', '肺脓肿', '粘连性肠梗阻', '急性呼吸衰竭', '感冒', '尼曼－匹克氏病', '减压病', '呼吸道合胞病毒肺炎', '呼吸衰竭', '苯中毒', '肺气肿', '肺-胸膜阿米巴病', '肺脓肿', '肺泡蛋白沉着症', '喘息样支气管炎', '肺脓肿', '呼吸道合胞病毒肺炎', '肺隐球菌病', '二硫化碳中毒', '百日咳', '肺转移瘤', '呼吸道合胞病毒肺炎', '感冒', '放射性肺炎', '肺大疱', '肺-胸膜阿米巴病', '肺大疱', '肺隐球菌病', '感冒', '肺出血－肾炎综合征', '肺-胸膜阿米巴病', '肺出血－肾炎综合征', '浓缩胆汁综合征', '肺炎杆菌肺炎', '呼吸道异物', '汞中毒', '过敏性肺炎', '肺炎性假瘤', '喘息样支气管炎', '感染性休克', '急性呼吸衰竭', '肺隐球菌病', '感染性休克', 'Goodpasture综合征', '肺放线菌病', '感染性休克', '浓缩胆汁综合征', '肺泡蛋白沉着症', '肺曲菌病', '大量羊水吸入', '肺念珠菌病', '肺隐球菌病', '肺曲菌病', '大楼病综合征', '喘息样支气管炎', '肺转移瘤', '大量羊水吸入', '感染性休克', '大楼病综合征', '肺曲菌病', '诺沃克类病毒胃肠炎', '减压病', '成人呼吸窘迫综合征', '肺炎性假瘤', '大楼病综合征', '肺炎球菌肺炎', '肺-胸膜阿米巴病', '尼曼－匹克氏病', '肺放线菌病', '肺炎性假瘤', '苯中毒', '过敏性肺炎', '百日咳', '减压病', '肺气肿', '汞中毒', '肺炎性假瘤', '尼曼－匹克氏病', '大量羊水吸入', '肺放线菌病', '肺泡蛋白沉着症', '百日咳', '减压病', '肺癌', '感冒', '呼吸道异物', '肺栓塞', '呼吸道异物', '放射性肺炎', '肺大疱', '放射性肺炎', '非典', '肺脓肿', '肺大泡', '苯中毒', '二硫化碳中毒', '感冒', '苯中毒', '感染性休克', '过敏性休克', '肺栓塞', '喘息样支气管炎', '汞中毒', '肺水肿', '肺放线菌病', '大量羊水吸入', '肺炎', '肺脓肿', '肺-胸膜阿米巴病', '肺炎', '二硫化碳中毒', '感染性休克', '肺水肿', '肺念珠菌病', '肺泡蛋白质沉积症', '农药中毒', '苯中毒', '大楼病综合征', '肺念珠菌病', '过敏性肺炎', '二硫化碳中毒', '肺泡蛋白沉着症', '肺栓塞', '尼曼－匹克氏病', '呼吸道异物', '大楼病综合征', '非典', '非典', '过敏性肺炎', '肺水肿', '肺-胸膜阿米巴病', '呼吸道合胞病毒肺炎', '肺炎性假瘤', '肺放线菌病', '非典', '肺曲菌病', '肺大疱', '尼曼－匹克氏病', '肺炎性假瘤', '诺沃克类病毒胃肠炎', '汞中毒', '肺放线菌病', '肺炎', '诺沃克类病毒胃肠炎', '苯中毒', '肺大疱', '呼吸性细支气管相关的间质性肺疾病', '肺曲菌病', '肺曲菌病', '过敏性休克', '呼吸衰竭', '诺沃克类病毒胃肠炎', '农药中毒', '肺大泡', '呼吸性细支气管相关的间质性肺疾病', '百日咳', '急性呼吸衰竭', '肺-胸膜阿米巴病', '肺癌', '急性呼吸衰竭', '肺大疱', '苯中毒', '粘连性肠梗阻', '肺炎', '镉中毒', '放射性肺炎', '呼吸衰竭', '大楼病综合征', '肺-胸膜阿米巴病', '放射性肺炎', '肺栓塞', '感染性休克', '呼吸道异物', '汞中毒', '脑肝肾综合征', '肺癌', '呼吸道合胞病毒肺炎', '成人呼吸窘迫综合征', '肺炎', '肺脓肿', '尼曼－匹克氏病', '呼吸道合胞病毒肺炎', '粘连性肠梗阻', '成人呼吸窘迫综合征', '百日咳', '肺大泡', '急性呼吸衰竭', '肺出血－肾炎综合征', '肺泡蛋白质沉积症', '急性呼吸衰竭', '肺水肿', '呼吸性细支气管相关的间质性肺疾病', '肺泡蛋白沉着症', '肺炎球菌肺炎', '过敏性肺炎', '急性呼吸衰竭', '肺炎杆菌肺炎', 'Goodpasture综合征', '感冒', '苯中毒', '肺癌', '呼吸道异物', '过敏性肺炎', '镉中毒', '急性呼吸衰竭', '肺-胸膜阿米巴病', '汞中毒', '急性呼吸衰竭', '肺转移瘤', '大量羊水吸入', '非典', '放射性肺炎', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '大叶性肺炎', '农药中毒', '肺-胸膜阿米巴病', '肺大疱', '放射性肺炎', '过敏性休克', 'Goodpasture综合征', '肺泡蛋白沉着症', '成人呼吸窘迫综合征', '非典', '大量羊水吸入', '呼吸道异物', '肺-胸膜阿米巴病', '百日咳', '大叶性肺炎', '肺炎性假瘤', '苯中毒', '粘连性肠梗阻', '呼吸性细支气管相关的间质性肺疾病', '急性呼吸衰竭', '肺-胸膜阿米巴病', '感冒', '大量羊水吸入', '呼吸衰竭', '汞中毒', '过敏性休克', '肺-胸膜阿米巴病', '肺念珠菌病', '肺癌', '肺大疱', '喘息样支气管炎', '肺炎性假瘤', '尼曼－匹克氏病', '肺泡蛋白沉着症', '汞中毒', '浓缩胆汁综合征', '感冒', '成人呼吸窘迫综合征', '肺气肿', '呼吸道合胞病毒肺炎', '镉中毒', 'Goodpasture综合征', '肺水肿', '单纯性肺嗜酸粒细胞浸润症', '肺念珠菌病', '过敏性休克', '肺泡蛋白沉着症', '肺大泡', '汞中毒', '肺脓肿', '百日咳', '肺念珠菌病', '苯中毒', '非典', '苯中毒', '减压病', '呼吸道合胞病毒肺炎', '过敏性休克', '呼吸道合胞病毒肺炎', '呼吸道合胞病毒肺炎', '呼吸道合胞病毒肺炎', '呼吸道异物', '急性呼吸衰竭', '肺泡蛋白质沉积症', '肺-胸膜阿米巴病', '百日咳', '肺炎', '肺炎杆菌肺炎', '单纯性肺嗜酸粒细胞浸润症', '农药中毒', '二硫化碳中毒', '苯中毒', '肺出血－肾炎综合征', '肺隐球菌病', '呼吸道异物', '过敏性休克', '肺脓肿', '百日咳', '肺-胸膜阿米巴病', '农药中毒', '镉中毒', '大楼病综合征', '呼吸道异物', '肺泡蛋白质沉积症', '大楼病综合征', '肺泡蛋白沉着症', '感染性休克', '肺大疱', '非典', '肺念珠菌病', '肺-胸膜阿米巴病', '镉中毒', '粘连性肠梗阻', '肺大泡', '肺隐球菌病', '肺癌', '百日咳', '肺泡蛋白质沉积症', '肺出血－肾炎综合征', '农药中毒', '大叶性肺炎', '尼曼－匹克氏病', '肺泡蛋白质沉积症', '过敏性肺炎', '感染性休克', '百日咳', '肺-胸膜阿米巴病', '粘连性肠梗阻', '非典', '过敏性肺炎', '减压病', '急性呼吸衰竭', '肺大泡', '肺癌', '肺隐球菌病', '肺炎杆菌肺炎', '成人呼吸窘迫综合征', '肺脓肿', '非典', '诺沃克类病毒胃肠炎', '大楼病综合征', '大量羊水吸入', '大叶性肺炎', '苯中毒', '大量羊水吸入', '过敏性肺炎', '大量羊水吸入', '苯中毒', '呼吸道合胞病毒肺炎', '脑肝肾综合征', '肺脓肿', '肺泡蛋白质沉积症', '肺出血－肾炎综合征', '诺沃克类病毒胃肠炎', '肺炎', '呼吸性细支气管相关的间质性肺疾病', '肺-胸膜阿米巴病', '大量羊水吸入', '肺-胸膜阿米巴病', '肺炎', '肺放线菌病', '诺沃克类病毒胃肠炎', '肺隐球菌病', '诺沃克类病毒胃肠炎', 'Goodpasture综合征', '过敏性休克', '粘连性肠梗阻', '肺念珠菌病', '肺隐球菌病', '肺-胸膜阿米巴病', '尼曼－匹克氏病', '放射性肺炎', '感染性休克', '肺癌', '诺沃克类病毒胃肠炎', '浓缩胆汁综合征', '肺转移瘤', '肺栓塞', '浓缩胆汁综合征', '呼吸性细支气管相关的间质性肺疾病', '单纯性肺嗜酸粒细胞浸润症', '百日咳', '肺念珠菌病', '肺炎球菌肺炎', '肺大泡', '感染性休克', '减压病', '肺癌', '二硫化碳中毒', '单纯性肺嗜酸粒细胞浸润症', '过敏性休克', '镉中毒', '肺转移瘤', '肺气肿', '脑肝肾综合征', '肺炎', '减压病', '脑肝肾综合征', '尼曼－匹克氏病', '肺大疱', '二硫化碳中毒', '呼吸性细支气管相关的间质性肺疾病', '肺栓塞', '大叶性肺炎', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '农药中毒', '肺大疱', '苯中毒', '肺大泡', '肺大泡', '减压病', '喘息样支气管炎', '过敏性休克', '急性呼吸衰竭', '农药中毒', '放射性肺炎', '大叶性肺炎', '脑肝肾综合征', '汞中毒', '非典', '肺炎杆菌肺炎', '肺-胸膜阿米巴病', '肺栓塞', '肺泡蛋白沉着症', '单纯性肺嗜酸粒细胞浸润症', '浓缩胆汁综合征', '急性呼吸衰竭', '肺癌', '感染性休克', 'Goodpasture综合征', '肺气肿', '大叶性肺炎', '苯中毒', '脑肝肾综合征', '放射性肺炎', '苯中毒', '感冒', '肺-胸膜阿米巴病', '肺栓塞', '肺念珠菌病', '肺大泡', '大楼病综合征', '肺炎', '肺炎杆菌肺炎', '肺栓塞', '肺炎杆菌肺炎', '感冒', '肺脓肿', '成人呼吸窘迫综合征', '二硫化碳中毒', '大量羊水吸入', '呼吸道异物', '肺脓肿', '肺转移瘤', '急性呼吸衰竭', '肺大疱', '减压病', '大楼病综合征', '过敏性休克', '粘连性肠梗阻', '肺炎杆菌肺炎', '过敏性肺炎', '苯中毒', '肺水肿', '肺放线菌病', '感染性休克', '放射性肺炎', '肺炎杆菌肺炎', '放射性肺炎', '肺念珠菌病', '镉中毒', '感染性休克', '大叶性肺炎', '放射性肺炎', '肺癌', '肺水肿', '肺曲菌病', '肺隐球菌病', '肺癌', '肺泡蛋白质沉积症', '肺水肿', '肺泡蛋白质沉积症', '大楼病综合征', '感冒', '肺转移瘤', '肺脓肿', '肺大疱', '成人呼吸窘迫综合征', '大楼病综合征', '诺沃克类病毒胃肠炎', '减压病', '肺泡蛋白质沉积症', '急性呼吸衰竭', '肺转移瘤', '肺隐球菌病', '肺癌', '肺水肿', '农药中毒', '呼吸性细支气管相关的间质性肺疾病', '肺炎性假瘤', '脑肝肾综合征', '肺水肿', '肺炎', '肺泡蛋白质沉积症', '肺炎球菌肺炎', '肺隐球菌病', '肺炎性假瘤', '肺泡蛋白沉着症', '过敏性肺炎', '农药中毒', '肺曲菌病', '肺炎性假瘤', '单纯性肺嗜酸粒细胞浸润症', '肺炎', '二硫化碳中毒', '肺念珠菌病', '过敏性肺炎', '呼吸道异物', '肺大泡', '减压病', '喘息样支气管炎', '过敏性肺炎', '肺炎球菌肺炎', '肺大疱', '非典', '急性呼吸衰竭', '肺曲菌病', '肺水肿', '减压病', 'Goodpasture综合征', '急性呼吸衰竭', '脑肝肾综合征', '肺泡蛋白质沉积症', '肺炎球菌肺炎', '肺大疱', '单纯性肺嗜酸粒细胞浸润症', '减压病', '减压病', '呼吸道合胞病毒肺炎', '诺沃克类病毒胃肠炎', '肺大疱', '肺转移瘤', '呼吸道合胞病毒肺炎', '肺出血－肾炎综合征', '浓缩胆汁综合征', '减压病', '肺气肿', '感冒', '过敏性肺炎', '肺隐球菌病', '肺隐球菌病', '呼吸道合胞病毒肺炎', '肺气肿', '肺放线菌病', '大楼病综合征', '肺曲菌病', '呼吸道合胞病毒肺炎', '苯中毒', '大量羊水吸入', '过敏性肺炎', '大叶性肺炎', '大叶性肺炎', '脑肝肾综合征', '二硫化碳中毒', '肺泡蛋白沉着症', '呼吸性细支气管相关的间质性肺疾病', '肺水肿', '尼曼－匹克氏病', '急性呼吸衰竭', '肺脓肿', '脑肝肾综合征', '浓缩胆汁综合征', '肺脓肿', '浓缩胆汁综合征', '放射性肺炎', '肺癌', '肺癌', '脑肝肾综合征', '呼吸道异物', '汞中毒', '苯中毒', '肺脓肿', '喘息样支气管炎', '二硫化碳中毒', '大叶性肺炎', '肺气肿', '成人呼吸窘迫综合征', '感冒', '尼曼－匹克氏病', '单纯性肺嗜酸粒细胞浸润症', '减压病', '肺-胸膜阿米巴病', '肺炎球菌肺炎', 'Goodpasture综合征', '单纯性肺嗜酸粒细胞浸润症', '大量羊水吸入', '尼曼－匹克氏病', '喘息样支气管炎', '喘息样支气管炎', '大叶性肺炎', '百日咳', '肺水肿', '非典', '过敏性休克', '肺大疱', '百日咳', '肺隐球菌病', '农药中毒', '呼吸衰竭', '肺大泡', '镉中毒', '肺放线菌病', '肺转移瘤', '肺炎杆菌肺炎', '肺大泡', '急性呼吸衰竭', '感染性休克', '肺气肿', '肺栓塞', '呼吸道异物', '肺出血－肾炎综合征', '肺念珠菌病', '肺放线菌病', '肺脓肿', '肺炎杆菌肺炎', 'Goodpasture综合征', '肺脓肿', '肺炎杆菌肺炎', '大楼病综合征', '百日咳', '呼吸衰竭', '呼吸衰竭', '非典', '粘连性肠梗阻', '肺气肿', '呼吸衰竭', '急性呼吸衰竭', '农药中毒', '过敏性肺炎', '过敏性肺炎', '急性呼吸衰竭', '非典', '呼吸道合胞病毒肺炎', '肺炎性假瘤', '肺炎球菌肺炎', '喘息样支气管炎', '肺念珠菌病', '肺脓肿', '肺炎杆菌肺炎', '苯中毒', '尼曼－匹克氏病', '急性呼吸衰竭', '放射性肺炎', '大量羊水吸入', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '单纯性肺嗜酸粒细胞浸润症', '呼吸性细支气管相关的间质性肺疾病', '肺炎性假瘤', '二硫化碳中毒', '二硫化碳中毒', '大楼病综合征', '大楼病综合征', '过敏性休克', '尼曼－匹克氏病', '浓缩胆汁综合征', '呼吸道合胞病毒肺炎', '肺泡蛋白沉着症', '尼曼－匹克氏病', '尼曼－匹克氏病', '大叶性肺炎', '肺大泡', '过敏性休克', '百日咳', '浓缩胆汁综合征', '肺念珠菌病', '喘息样支气管炎', '肺脓肿', '肺放线菌病', '肺曲菌病', '非典', '肺炎杆菌肺炎', '过敏性休克', '镉中毒', '成人呼吸窘迫综合征', '农药中毒', '肺大疱', '脑肝肾综合征', '肺脓肿', '肺放线菌病', '肺癌', '农药中毒', '肺出血－肾炎综合征', '肺大疱', '成人呼吸窘迫综合征', '镉中毒', '肺栓塞', '呼吸衰竭', '肺泡蛋白沉着症', '浓缩胆汁综合征', '急性呼吸衰竭', '百日咳', '肺癌', '大楼病综合征', '百日咳', '单纯性肺嗜酸粒细胞浸润症', '肺放线菌病', '肺曲菌病', '诺沃克类病毒胃肠炎', '汞中毒', '肺出血－肾炎综合征', '成人呼吸窘迫综合征', '肺栓塞', '呼吸道合胞病毒肺炎', '急性呼吸衰竭', '脑肝肾综合征', '粘连性肠梗阻', '肺水肿', '非典', '肺出血－肾炎综合征', '粘连性肠梗阻', '肺气肿', '过敏性肺炎', '肺隐球菌病', '成人呼吸窘迫综合征', '感冒', '减压病', '感冒', '粘连性肠梗阻', '感冒', '诺沃克类病毒胃肠炎', '肺脓肿', '粘连性肠梗阻', '肺癌', '肺泡蛋白质沉积症', '肺大疱', '过敏性休克', '肺炎性假瘤', '苯中毒', '脑肝肾综合征', '肺癌', '肺水肿', '大量羊水吸入', '诺沃克类病毒胃肠炎', '呼吸道合胞病毒肺炎', '肺-胸膜阿米巴病', '肺栓塞', '肺炎性假瘤', '镉中毒', '呼吸道异物', '诺沃克类病毒胃肠炎', '呼吸道异物', '过敏性休克', '呼吸道异物', '成人呼吸窘迫综合征', '感染性休克', '农药中毒', '肺炎球菌肺炎', '肺放线菌病', '肺炎', '过敏性肺炎', '大叶性肺炎', '呼吸衰竭', '肺念珠菌病', '二硫化碳中毒', '呼吸道异物', '过敏性肺炎', '大量羊水吸入', '肺水肿', '成人呼吸窘迫综合征', '尼曼－匹克氏病', '镉中毒', '百日咳', '百日咳', '肺癌', '成人呼吸窘迫综合征', '呼吸性细支气管相关的间质性肺疾病', '浓缩胆汁综合征', '肺-胸膜阿米巴病', '肺炎杆菌肺炎', '百日咳', '肺炎性假瘤', '肺-胸膜阿米巴病', '急性呼吸衰竭', '苯中毒', '肺放线菌病', '肺炎杆菌肺炎', '肺炎性假瘤', '感染性休克', '苯中毒', '过敏性肺炎', '过敏性休克', '呼吸道合胞病毒肺炎', '过敏性休克', '肺泡蛋白沉着症', '尼曼－匹克氏病', '呼吸道异物', '肺脓肿', '过敏性肺炎', '肺泡蛋白质沉积症', '感染性休克', '肺-胸膜阿米巴病', '肺气肿', '肺水肿', '肺隐球菌病', '浓缩胆汁综合征', '急性呼吸衰竭', '感染性休克', '二硫化碳中毒', '肺泡蛋白沉着症', '肺转移瘤', '肺炎杆菌肺炎', '尼曼－匹克氏病', '诺沃克类病毒胃肠炎', '肺泡蛋白沉着症', '苯中毒', '呼吸道异物', '二硫化碳中毒', '过敏性肺炎', '肺炎球菌肺炎', '诺沃克类病毒胃肠炎', 'Goodpasture综合征', 'Goodpasture综合征', '肺炎', '过敏性肺炎', '诺沃克类病毒胃肠炎', '肺放线菌病', '肺炎球菌肺炎', '肺水肿', '非典', '成人呼吸窘迫综合征', '肺曲菌病', '肺炎杆菌肺炎', '肺念珠菌病']
import time
from urllib.parse import quote
import  string


total_time = 0
d = driver()

realtarget = ['癌症'] * 0 + dataset[0:100]


i=0
for entity in realtarget:
    i+=1
    print(i)
    url = "http://localhost:8080/neo4j/" + entity
    url = quote(url, safe=string.printable)  # safe表示可以忽略的字符
    t0 = time.time()
    d.get_html(url)
    total_time += time.time() - t0

print(total_time)
