# -*- coding: UTF-8 -*-

disease_drug = ["""
{
    "text": "得了$，吃什么药好",
    "intent": "disease_drug",
    "entities": []
},""","""
{
    "text": "得了$，有什么药比较有用",
    "intent": "disease_drug",
    "entities": []
},""","""
{
    "text": "$吃什么药比较有用",
    "intent": "disease_drug",
    "entities": []
},""","""
{
    "text": "$，推荐一些药品",
    "intent": "disease_drug",
    "entities": []
},"""
                ]


disease_desc = ["""
{
    "text": "$是什么",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "$是什么病",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "$这个病是什么",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "什么是$",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "介绍下$",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "请介绍下$病",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "科普下$",
    "intent": "disease_desc",
    "entities": []
},""","""
{
    "text": "请问什么是$",
    "intent": "disease_desc",
    "entities": []
},"""
]


ask_how_doctor = ["""
{
    "text": "$医生怎么样",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "介绍下$医生",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$医生介绍下",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "请给我介绍下$医生",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "介绍下$医生的背景",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "介绍下$医生的资料",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$医生的资料",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$医生擅长什么",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$擅长什么",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$医生擅长治疗什么",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "介绍下医院的$医生",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "医院的$医生怎么样",
    "intent": "ask_how_doctor",
    "entities": []
},""","""
{
    "text": "$医生的简介",
    "intent": "ask_how_doctor",
    "entities": []
},"""
]

disease_symptom = ["""
{
    "text": "$有什么症状",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "$有什么表现",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$会有什么表现",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$有什么症状",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$病有什么特征",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$病有什么早期症状",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$会怎么样",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$有什么表征",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$有什么临床现象",
    "intent": "disease_symptom",
    "entities": []
},""","""
{
    "text": "得了$有什么特点",
    "intent": "disease_symptom",
    "entities": []
},"""
]

recommend_doctor = ["""
{
    "text": "我得了$，求推荐医生",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "我得了$，求推荐医生,在浙江",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "在山东，$病有什么医生推荐",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "$病有什么医生擅长治这个",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "什么医生擅长治$病",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "推荐下擅长治$的好医生",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "推荐下治$的专家",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "推荐下能治$的专家",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "推荐下擅长治$的专家",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "什么医生能治$",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "$有什么好的医生",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "治$的医生",
    "intent": "recommend_doctor",
    "entities": []
},""","""
{
    "text": "$推荐下医生",
    "intent": "recommend_doctor",
    "entities": []
},"""
]

disease_cause = ["""
{
    "text": "$的原因",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "什么会导致$",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "$病因",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "$病因是什么",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "什么是$病因",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "我为什么会得$病",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "我为什么会患$",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "我为什么会得$",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "怎么就得了$这个病呢",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "为什么会得$这个病呢",
    "intent": "disease_cause",
    "entities": []
},""","""
{
    "text": "什么会引发$",
    "intent": "disease_cause",
    "entities": []
},"""
]

disease_acompany = ["""
{
    "text": "$有什么并发症",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "得了$有什么并发症",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "得了$有什么一起发生",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "得了$有什么一起出现",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "得了$会带来哪些病",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "$的并发症",
    "intent": "disease_acompany",
    "entities": []
},""","""
{
    "text": "$的并发疾病",
    "intent": "disease_acompany",
    "entities": []
},"""
]

disease_not_food = ["""
{
    "text": "$禁食什么",
    "intent": "disease_not_food",
    "entities": []
},""","""
{
    "text": "得了$什么忌口",
    "intent": "disease_not_food",
    "entities": []
},""","""
{
    "text": "得了$不能吃什么",
    "intent": "disease_not_food",
    "entities": []
},""","""
{
    "text": "得了$不要吃什么",
    "intent": "disease_not_food",
    "entities": []
},""","""
{
    "text": "$不要吃什么",
    "intent": "disease_not_food",
    "entities": []
},""","""
{
    "text": "$不能吃什么",
    "intent": "disease_not_food",
    "entities": []
},"""
]

disease_do_food = ["""
{
    "text": "$推荐吃什么",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$推荐食物",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$最好吃什么",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "得了$，要吃什么",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$要吃什么",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$能吃什么",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$推荐食物",
    "intent": "disease_do_food",
    "entities": []
},""","""
{
    "text": "$有什么推荐食物",
    "intent": "disease_do_food",
    "entities": []
},"""
]

disease_check = ["""
{
    "text": "$怎么检测",
    "intent": "disease_check",
    "entities": []
},""","""
{
    "text": "$怎么检查",
    "intent": "disease_check",
    "entities": []
},""","""
{
    "text": "$怎么检查$",
    "intent": "disease_check",
    "entities": []
},""","""
{
    "text": "怎么检测$",
    "intent": "disease_check",
    "entities": []
},""","""
{
    "text": "有什么方法检查$",
    "intent": "disease_check",
    "entities": []
},""","""
{
    "text": "$的检测手段",
    "intent": "disease_check",
    "entities": []
},"""
]

disease_prevent = ["""
{
    "text": "怎么预防$",
    "intent": "disease_prevent",
    "entities": []
},""","""
{
    "text": "如何预防$",
    "intent": "disease_prevent",
    "entities": []
},""","""
{
    "text": "怎么避免$",
    "intent": "disease_prevent",
    "entities": []
},""","""
{
    "text": "$的预防手段",
    "intent": "disease_prevent",
    "entities": []
},""","""
{
    "text": "$预防措施",
    "intent": "disease_prevent",
    "entities": []
},""","""
{
    "text": "怎么才可以防止$",
    "intent": "disease_prevent",
    "entities": []
},"""
]

disease_easyget = ["""
{
    "text": "哪些人容易得$",
    "intent": "disease_easyget",
    "entities": []
},""","""
{
    "text": "$的易感人群",
    "intent": "disease_easyget",
    "entities": []
},""","""
{
    "text": "易感人群$",
    "intent": "disease_easyget",
    "entities": []
},""","""
{
    "text": "什么体质会得$",
    "intent": "disease_easyget",
    "entities": []
},""","""
{
    "text": "什么人容易得$",
    "intent": "disease_easyget",
    "entities": []
},""","""
{
    "text": "$会感染哪些",
    "intent": "disease_easyget",
    "entities": []
},"""
]

disease_cureprob = ["""
{
    "text": "$能治愈吗",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "$治好的概率",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "治好$概率",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "能治好$吗",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "能医好$吗",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "$有救吗",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "$能治吗",
    "intent": "disease_cureprob",
    "entities": []
},""","""
{
    "text": "$可以治疗吗",
    "intent": "disease_cureprob",
    "entities": []
},"""
]

disease_cureway = ["""
{
    "text": "$怎么治疗",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "$治疗方式",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "怎么治$",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "如何治好$",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "$治疗手段",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "怎么医好$这个病",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "$诊疗方式",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "治疗$怎么办",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "$咋治",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "患有$怎么办",
    "intent": "disease_cureway",
    "entities": []
},""","""
{
    "text": "得了$怎么办",
    "intent": "disease_cureway",
    "entities": []
},"""
]



res = ""
dataset = ['成人呼吸窘迫综合征', '肺念珠菌病', '肺炎性假瘤', '农药中毒', '肺炎性假瘤', '镉中毒', '呼吸性细支气管相关的间质性肺疾病', '镉中毒', '农药中毒', '肺炎球菌肺炎', '农药中毒', '呼吸衰竭', '尼曼－匹克氏病', '成人呼吸窘迫综合征', '肺炎', '肺泡蛋白质沉积症', '肺炎性假瘤', '呼吸性细支气管相关的间质性肺疾病', '苯中毒', '肺脓肿', '过敏性休克', '肺-胸膜阿米巴病', '肺炎球菌肺炎', '减压病', '过敏性肺炎', '感冒', '肺念珠菌病', '感染性休克', '肺癌', '肺-胸膜阿米巴病', '镉中毒', '喘息样支气管炎', '肺炎杆菌肺炎', '肺转移瘤', '感染性休克', '肺水肿', '肺大泡', '尼曼－匹克氏病', '过敏性肺炎', '过敏性肺炎', '肺炎球菌肺炎', '感冒', '肺气肿', '大叶性肺炎', '肺癌', '肺念珠菌病', '二硫化碳中毒', '呼吸衰竭', '肺气肿', '成人呼吸窘迫综合征', '呼吸性细支气管相关的间质性肺疾病', '汞中毒', '镉中毒', '肺放线菌病', '减压病', '肺癌', '减压病', '肺放线菌病', '肺大疱', '肺癌', '肺栓塞', '粘连性肠梗阻', '肺炎性假瘤', '肺脓肿', '肺放线菌病', '喘息样支气管炎', '百日咳', '肺大泡', '肺气肿', '肺癌', '肺炎', '肺隐球菌病', '农药中毒', '大量羊水吸入', '肺出血－肾炎综合征', '成人呼吸窘迫综合征', '成人呼吸窘迫综合征', '放射性肺炎', '放射性肺炎', '过敏性休克', '肺放线菌病', '肺炎', '过敏性肺炎', '肺炎', '减压病', '肺曲菌病', '呼吸衰竭', '大楼病综合征', '肺大泡', '肺炎杆菌肺炎', '肺放线菌病', '急性呼吸衰竭', '肺水肿', '减压病', '减压病', '镉中毒', '过敏性肺炎', '肺泡蛋白质沉积症', '肺大疱', '肺隐球菌病', '肺-胸膜阿米巴病', '肺炎杆菌肺炎', '肺炎性假瘤', '肺曲菌病', '肺念珠菌病', '汞中毒', '呼吸性细支气管相关的间质性肺疾病', '肺脓肿', '二硫化碳中毒', '肺念珠菌病', '汞中毒', '镉中毒', '肺-胸膜阿米巴病', '肺大疱', '肺大泡', '大楼病综合征', '成人呼吸窘迫综合征', '汞中毒', '呼吸道合胞病毒肺炎', '肺出血－肾炎综合征', '肺出血－肾炎综合征', '减压病', '镉中毒', '浓缩胆汁综合征', '农药中毒', '肺炎杆菌肺炎', '过敏性休克', '诺沃克类病毒胃肠炎', '呼吸性细支气管相关的间质性肺疾病', '感冒', '汞中毒', '肺栓塞', '苯中毒', '肺泡蛋白沉着症', '肺隐球菌病', '大叶性肺炎', 'Goodpasture综合征', '肺曲菌病', 'Goodpasture综合征', '镉中毒', '感冒', '肺出血－肾炎综合征', '肺曲菌病', '肺隐球菌病', '诺沃克类病毒胃肠炎', '喘息样支气管炎', '肺放线菌病', '肺气肿', '单纯性肺嗜酸粒细胞浸润症', '农药中毒', '肺泡蛋白沉着症', '尼曼－匹克氏病', '浓缩胆汁综合征', '肺气肿', '汞中毒', '单纯性肺嗜酸粒细胞浸润症', '肺炎杆菌肺炎', '镉中毒', '成人呼吸窘迫综合征', '汞中毒', '肺大疱', '肺-胸膜阿米巴病', '大叶性肺炎', '百日咳', '肺炎', '百日咳', '过敏性休克', '肺炎杆菌肺炎', '过敏性肺炎', '尼曼－匹克氏病', '呼吸性细支气管相关的间质性肺疾病', '脑肝肾综合征', '肺脓肿', '粘连性肠梗阻', '急性呼吸衰竭', '感冒', '尼曼－匹克氏病', '减压病', '呼吸道合胞病毒肺炎', '呼吸衰竭', '苯中毒', '肺气肿', '肺-胸膜阿米巴病', '肺脓肿', '肺泡蛋白沉着症', '喘息样支气管炎', '肺脓肿', '呼吸道合胞病毒肺炎', '肺隐球菌病', '二硫化碳中毒', '百日咳', '肺转移瘤', '呼吸道合胞病毒肺炎', '感冒', '放射性肺炎', '肺大疱', '肺-胸膜阿米巴病', '肺大疱', '肺隐球菌病', '感冒', '肺出血－肾炎综合征', '肺-胸膜阿米巴病', '肺出血－肾炎综合征', '浓缩胆汁综合征', '肺炎杆菌肺炎', '呼吸道异物', '汞中毒', '过敏性肺炎', '肺炎性假瘤', '喘息样支气管炎', '感染性休克', '急性呼吸衰竭', '肺隐球菌病', '感染性休克', 'Goodpasture综合征', '肺放线菌病', '感染性休克', '浓缩胆汁综合征', '肺泡蛋白沉着症', '肺曲菌病', '大量羊水吸入', '肺念珠菌病', '肺隐球菌病', '肺曲菌病', '大楼病综合征', '喘息样支气管炎', '肺转移瘤', '大量羊水吸入', '感染性休克', '大楼病综合征', '肺曲菌病', '诺沃克类病毒胃肠炎', '减压病', '成人呼吸窘迫综合征', '肺炎性假瘤', '大楼病综合征', '肺炎球菌肺炎', '肺-胸膜阿米巴病', '尼曼－匹克氏病', '肺放线菌病', '肺炎性假瘤', '苯中毒', '过敏性肺炎', '百日咳', '减压病', '肺气肿', '汞中毒', '肺炎性假瘤', '尼曼－匹克氏病', '大量羊水吸入', '肺放线菌病', '肺泡蛋白沉着症', '百日咳', '减压病', '肺癌', '感冒', '呼吸道异物', '肺栓塞', '呼吸道异物', '放射性肺炎', '肺大疱', '放射性肺炎', '非典', '肺脓肿', '肺大泡', '苯中毒', '二硫化碳中毒', '感冒', '苯中毒', '感染性休克', '过敏性休克', '肺栓塞', '喘息样支气管炎', '汞中毒', '肺水肿', '肺放线菌病', '大量羊水吸入', '肺炎', '肺脓肿', '肺-胸膜阿米巴病', '肺炎', '二硫化碳中毒', '感染性休克', '肺水肿', '肺念珠菌病', '肺泡蛋白质沉积症', '农药中毒', '苯中毒', '大楼病综合征', '肺念珠菌病', '过敏性肺炎', '二硫化碳中毒', '肺泡蛋白沉着症', '肺栓塞', '尼曼－匹克氏病', '呼吸道异物', '大楼病综合征', '非典', '非典', '过敏性肺炎', '肺水肿', '肺-胸膜阿米巴病', '呼吸道合胞病毒肺炎', '肺炎性假瘤', '肺放线菌病', '非典', '肺曲菌病', '肺大疱', '尼曼－匹克氏病', '肺炎性假瘤', '诺沃克类病毒胃肠炎', '汞中毒', '肺放线菌病', '肺炎', '诺沃克类病毒胃肠炎', '苯中毒', '肺大疱', '呼吸性细支气管相关的间质性肺疾病', '肺曲菌病', '肺曲菌病', '过敏性休克', '呼吸衰竭', '诺沃克类病毒胃肠炎', '农药中毒', '肺大泡', '呼吸性细支气管相关的间质性肺疾病', '百日咳', '急性呼吸衰竭', '肺-胸膜阿米巴病', '肺癌', '急性呼吸衰竭', '肺大疱', '苯中毒', '粘连性肠梗阻', '肺炎', '镉中毒', '放射性肺炎', '呼吸衰竭', '大楼病综合征', '肺-胸膜阿米巴病', '放射性肺炎', '肺栓塞', '感染性休克', '呼吸道异物', '汞中毒', '脑肝肾综合征', '肺癌', '呼吸道合胞病毒肺炎', '成人呼吸窘迫综合征', '肺炎', '肺脓肿', '尼曼－匹克氏病', '呼吸道合胞病毒肺炎', '粘连性肠梗阻', '成人呼吸窘迫综合征', '百日咳', '肺大泡', '急性呼吸衰竭', '肺出血－肾炎综合征', '肺泡蛋白质沉积症', '急性呼吸衰竭', '肺水肿', '呼吸性细支气管相关的间质性肺疾病', '肺泡蛋白沉着症', '肺炎球菌肺炎', '过敏性肺炎', '急性呼吸衰竭', '肺炎杆菌肺炎', 'Goodpasture综合征', '感冒', '苯中毒', '肺癌', '呼吸道异物', '过敏性肺炎', '镉中毒', '急性呼吸衰竭', '肺-胸膜阿米巴病', '汞中毒', '急性呼吸衰竭', '肺转移瘤', '大量羊水吸入', '非典', '放射性肺炎', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '大叶性肺炎', '农药中毒', '肺-胸膜阿米巴病', '肺大疱', '放射性肺炎', '过敏性休克', 'Goodpasture综合征', '肺泡蛋白沉着症', '成人呼吸窘迫综合征', '非典', '大量羊水吸入', '呼吸道异物', '肺-胸膜阿米巴病', '百日咳', '大叶性肺炎', '肺炎性假瘤', '苯中毒', '粘连性肠梗阻', '呼吸性细支气管相关的间质性肺疾病', '急性呼吸衰竭', '肺-胸膜阿米巴病', '感冒', '大量羊水吸入', '呼吸衰竭', '汞中毒', '过敏性休克', '肺-胸膜阿米巴病', '肺念珠菌病', '肺癌', '肺大疱', '喘息样支气管炎', '肺炎性假瘤', '尼曼－匹克氏病', '肺泡蛋白沉着症', '汞中毒', '浓缩胆汁综合征', '感冒', '成人呼吸窘迫综合征', '肺气肿', '呼吸道合胞病毒肺炎', '镉中毒', 'Goodpasture综合征', '肺水肿', '单纯性肺嗜酸粒细胞浸润症', '肺念珠菌病', '过敏性休克', '肺泡蛋白沉着症', '肺大泡', '汞中毒', '肺脓肿', '百日咳', '肺念珠菌病', '苯中毒', '非典', '苯中毒', '减压病', '呼吸道合胞病毒肺炎', '过敏性休克', '呼吸道合胞病毒肺炎', '呼吸道合胞病毒肺炎', '呼吸道合胞病毒肺炎', '呼吸道异物', '急性呼吸衰竭', '肺泡蛋白质沉积症', '肺-胸膜阿米巴病', '百日咳', '肺炎', '肺炎杆菌肺炎', '单纯性肺嗜酸粒细胞浸润症', '农药中毒', '二硫化碳中毒', '苯中毒', '肺出血－肾炎综合征', '肺隐球菌病', '呼吸道异物', '过敏性休克', '肺脓肿', '百日咳', '肺-胸膜阿米巴病', '农药中毒', '镉中毒', '大楼病综合征', '呼吸道异物', '肺泡蛋白质沉积症', '大楼病综合征', '肺泡蛋白沉着症', '感染性休克', '肺大疱', '非典', '肺念珠菌病', '肺-胸膜阿米巴病', '镉中毒', '粘连性肠梗阻', '肺大泡', '肺隐球菌病', '肺癌', '百日咳', '肺泡蛋白质沉积症', '肺出血－肾炎综合征', '农药中毒', '大叶性肺炎', '尼曼－匹克氏病', '肺泡蛋白质沉积症', '过敏性肺炎', '感染性休克', '百日咳', '肺-胸膜阿米巴病', '粘连性肠梗阻', '非典', '过敏性肺炎', '减压病', '急性呼吸衰竭', '肺大泡', '肺癌', '肺隐球菌病', '肺炎杆菌肺炎', '成人呼吸窘迫综合征', '肺脓肿', '非典', '诺沃克类病毒胃肠炎', '大楼病综合征', '大量羊水吸入', '大叶性肺炎', '苯中毒', '大量羊水吸入', '过敏性肺炎', '大量羊水吸入', '苯中毒', '呼吸道合胞病毒肺炎', '脑肝肾综合征', '肺脓肿', '肺泡蛋白质沉积症', '肺出血－肾炎综合征', '诺沃克类病毒胃肠炎', '肺炎', '呼吸性细支气管相关的间质性肺疾病', '肺-胸膜阿米巴病', '大量羊水吸入', '肺-胸膜阿米巴病', '肺炎', '肺放线菌病', '诺沃克类病毒胃肠炎', '肺隐球菌病', '诺沃克类病毒胃肠炎', 'Goodpasture综合征', '过敏性休克', '粘连性肠梗阻', '肺念珠菌病', '肺隐球菌病', '肺-胸膜阿米巴病', '尼曼－匹克氏病', '放射性肺炎', '感染性休克', '肺癌', '诺沃克类病毒胃肠炎', '浓缩胆汁综合征', '肺转移瘤', '肺栓塞', '浓缩胆汁综合征', '呼吸性细支气管相关的间质性肺疾病', '单纯性肺嗜酸粒细胞浸润症', '百日咳', '肺念珠菌病', '肺炎球菌肺炎', '肺大泡', '感染性休克', '减压病', '肺癌', '二硫化碳中毒', '单纯性肺嗜酸粒细胞浸润症', '过敏性休克', '镉中毒', '肺转移瘤', '肺气肿', '脑肝肾综合征', '肺炎', '减压病', '脑肝肾综合征', '尼曼－匹克氏病', '肺大疱', '二硫化碳中毒', '呼吸性细支气管相关的间质性肺疾病', '肺栓塞', '大叶性肺炎', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '农药中毒', '肺大疱', '苯中毒', '肺大泡', '肺大泡', '减压病', '喘息样支气管炎', '过敏性休克', '急性呼吸衰竭', '农药中毒', '放射性肺炎', '大叶性肺炎', '脑肝肾综合征', '汞中毒', '非典', '肺炎杆菌肺炎', '肺-胸膜阿米巴病', '肺栓塞', '肺泡蛋白沉着症', '单纯性肺嗜酸粒细胞浸润症', '浓缩胆汁综合征', '急性呼吸衰竭', '肺癌', '感染性休克', 'Goodpasture综合征', '肺气肿', '大叶性肺炎', '苯中毒', '脑肝肾综合征', '放射性肺炎', '苯中毒', '感冒', '肺-胸膜阿米巴病', '肺栓塞', '肺念珠菌病', '肺大泡', '大楼病综合征', '肺炎', '肺炎杆菌肺炎', '肺栓塞', '肺炎杆菌肺炎', '感冒', '肺脓肿', '成人呼吸窘迫综合征', '二硫化碳中毒', '大量羊水吸入', '呼吸道异物', '肺脓肿', '肺转移瘤', '急性呼吸衰竭', '肺大疱', '减压病', '大楼病综合征', '过敏性休克', '粘连性肠梗阻', '肺炎杆菌肺炎', '过敏性肺炎', '苯中毒', '肺水肿', '肺放线菌病', '感染性休克', '放射性肺炎', '肺炎杆菌肺炎', '放射性肺炎', '肺念珠菌病', '镉中毒', '感染性休克', '大叶性肺炎', '放射性肺炎', '肺癌', '肺水肿', '肺曲菌病', '肺隐球菌病', '肺癌', '肺泡蛋白质沉积症', '肺水肿', '肺泡蛋白质沉积症', '大楼病综合征', '感冒', '肺转移瘤', '肺脓肿', '肺大疱', '成人呼吸窘迫综合征', '大楼病综合征', '诺沃克类病毒胃肠炎', '减压病', '肺泡蛋白质沉积症', '急性呼吸衰竭', '肺转移瘤', '肺隐球菌病', '肺癌', '肺水肿', '农药中毒', '呼吸性细支气管相关的间质性肺疾病', '肺炎性假瘤', '脑肝肾综合征', '肺水肿', '肺炎', '肺泡蛋白质沉积症', '肺炎球菌肺炎', '肺隐球菌病', '肺炎性假瘤', '肺泡蛋白沉着症', '过敏性肺炎', '农药中毒', '肺曲菌病', '肺炎性假瘤', '单纯性肺嗜酸粒细胞浸润症', '肺炎', '二硫化碳中毒', '肺念珠菌病', '过敏性肺炎', '呼吸道异物', '肺大泡', '减压病', '喘息样支气管炎', '过敏性肺炎', '肺炎球菌肺炎', '肺大疱', '非典', '急性呼吸衰竭', '肺曲菌病', '肺水肿', '减压病', 'Goodpasture综合征', '急性呼吸衰竭', '脑肝肾综合征', '肺泡蛋白质沉积症', '肺炎球菌肺炎', '肺大疱', '单纯性肺嗜酸粒细胞浸润症', '减压病', '减压病', '呼吸道合胞病毒肺炎', '诺沃克类病毒胃肠炎', '肺大疱', '肺转移瘤', '呼吸道合胞病毒肺炎', '肺出血－肾炎综合征', '浓缩胆汁综合征', '减压病', '肺气肿', '感冒', '过敏性肺炎', '肺隐球菌病', '肺隐球菌病', '呼吸道合胞病毒肺炎', '肺气肿', '肺放线菌病', '大楼病综合征', '肺曲菌病', '呼吸道合胞病毒肺炎', '苯中毒', '大量羊水吸入', '过敏性肺炎', '大叶性肺炎', '大叶性肺炎', '脑肝肾综合征', '二硫化碳中毒', '肺泡蛋白沉着症', '呼吸性细支气管相关的间质性肺疾病', '肺水肿', '尼曼－匹克氏病', '急性呼吸衰竭', '肺脓肿', '脑肝肾综合征', '浓缩胆汁综合征', '肺脓肿', '浓缩胆汁综合征', '放射性肺炎', '肺癌', '肺癌', '脑肝肾综合征', '呼吸道异物', '汞中毒', '苯中毒', '肺脓肿', '喘息样支气管炎', '二硫化碳中毒', '大叶性肺炎', '肺气肿', '成人呼吸窘迫综合征', '感冒', '尼曼－匹克氏病', '单纯性肺嗜酸粒细胞浸润症', '减压病', '肺-胸膜阿米巴病', '肺炎球菌肺炎', 'Goodpasture综合征', '单纯性肺嗜酸粒细胞浸润症', '大量羊水吸入', '尼曼－匹克氏病', '喘息样支气管炎', '喘息样支气管炎', '大叶性肺炎', '百日咳', '肺水肿', '非典', '过敏性休克', '肺大疱', '百日咳', '肺隐球菌病', '农药中毒', '呼吸衰竭', '肺大泡', '镉中毒', '肺放线菌病', '肺转移瘤', '肺炎杆菌肺炎', '肺大泡', '急性呼吸衰竭', '感染性休克', '肺气肿', '肺栓塞', '呼吸道异物', '肺出血－肾炎综合征', '肺念珠菌病', '肺放线菌病', '肺脓肿', '肺炎杆菌肺炎', 'Goodpasture综合征', '肺脓肿', '肺炎杆菌肺炎', '大楼病综合征', '百日咳', '呼吸衰竭', '呼吸衰竭', '非典', '粘连性肠梗阻', '肺气肿', '呼吸衰竭', '急性呼吸衰竭', '农药中毒', '过敏性肺炎', '过敏性肺炎', '急性呼吸衰竭', '非典', '呼吸道合胞病毒肺炎', '肺炎性假瘤', '肺炎球菌肺炎', '喘息样支气管炎', '肺念珠菌病', '肺脓肿', '肺炎杆菌肺炎', '苯中毒', '尼曼－匹克氏病', '急性呼吸衰竭', '放射性肺炎', '大量羊水吸入', '肺泡蛋白质沉积症', '诺沃克类病毒胃肠炎', '单纯性肺嗜酸粒细胞浸润症', '呼吸性细支气管相关的间质性肺疾病', '肺炎性假瘤', '二硫化碳中毒', '二硫化碳中毒', '大楼病综合征', '大楼病综合征', '过敏性休克', '尼曼－匹克氏病', '浓缩胆汁综合征', '呼吸道合胞病毒肺炎', '肺泡蛋白沉着症', '尼曼－匹克氏病', '尼曼－匹克氏病', '大叶性肺炎', '肺大泡', '过敏性休克', '百日咳', '浓缩胆汁综合征', '肺念珠菌病', '喘息样支气管炎', '肺脓肿', '肺放线菌病', '肺曲菌病', '非典', '肺炎杆菌肺炎', '过敏性休克', '镉中毒', '成人呼吸窘迫综合征', '农药中毒', '肺大疱', '脑肝肾综合征', '肺脓肿', '肺放线菌病', '肺癌', '农药中毒', '肺出血－肾炎综合征', '肺大疱', '成人呼吸窘迫综合征', '镉中毒', '肺栓塞', '呼吸衰竭', '肺泡蛋白沉着症', '浓缩胆汁综合征', '急性呼吸衰竭', '百日咳', '肺癌', '大楼病综合征', '百日咳', '单纯性肺嗜酸粒细胞浸润症', '肺放线菌病', '肺曲菌病', '诺沃克类病毒胃肠炎', '汞中毒', '肺出血－肾炎综合征', '成人呼吸窘迫综合征', '肺栓塞', '呼吸道合胞病毒肺炎', '急性呼吸衰竭', '脑肝肾综合征', '粘连性肠梗阻', '肺水肿', '非典', '肺出血－肾炎综合征', '粘连性肠梗阻', '肺气肿', '过敏性肺炎', '肺隐球菌病', '成人呼吸窘迫综合征', '感冒', '减压病', '感冒', '粘连性肠梗阻', '感冒', '诺沃克类病毒胃肠炎', '肺脓肿', '粘连性肠梗阻', '肺癌', '肺泡蛋白质沉积症', '肺大疱', '过敏性休克', '肺炎性假瘤', '苯中毒', '脑肝肾综合征', '肺癌', '肺水肿', '大量羊水吸入', '诺沃克类病毒胃肠炎', '呼吸道合胞病毒肺炎', '肺-胸膜阿米巴病', '肺栓塞', '肺炎性假瘤', '镉中毒', '呼吸道异物', '诺沃克类病毒胃肠炎', '呼吸道异物', '过敏性休克', '呼吸道异物', '成人呼吸窘迫综合征', '感染性休克', '农药中毒', '肺炎球菌肺炎', '肺放线菌病', '肺炎', '过敏性肺炎', '大叶性肺炎', '呼吸衰竭', '肺念珠菌病', '二硫化碳中毒', '呼吸道异物', '过敏性肺炎', '大量羊水吸入', '肺水肿', '成人呼吸窘迫综合征', '尼曼－匹克氏病', '镉中毒', '百日咳', '百日咳', '肺癌', '成人呼吸窘迫综合征', '呼吸性细支气管相关的间质性肺疾病', '浓缩胆汁综合征', '肺-胸膜阿米巴病', '肺炎杆菌肺炎', '百日咳', '肺炎性假瘤', '肺-胸膜阿米巴病', '急性呼吸衰竭', '苯中毒', '肺放线菌病', '肺炎杆菌肺炎', '肺炎性假瘤', '感染性休克', '苯中毒', '过敏性肺炎', '过敏性休克', '呼吸道合胞病毒肺炎', '过敏性休克', '肺泡蛋白沉着症', '尼曼－匹克氏病', '呼吸道异物', '肺脓肿', '过敏性肺炎', '肺泡蛋白质沉积症', '感染性休克', '肺-胸膜阿米巴病', '肺气肿', '肺水肿', '肺隐球菌病', '浓缩胆汁综合征', '急性呼吸衰竭', '感染性休克', '二硫化碳中毒', '肺泡蛋白沉着症', '肺转移瘤', '肺炎杆菌肺炎', '尼曼－匹克氏病', '诺沃克类病毒胃肠炎', '肺泡蛋白沉着症', '苯中毒', '呼吸道异物', '二硫化碳中毒', '过敏性肺炎', '肺炎球菌肺炎', '诺沃克类病毒胃肠炎', 'Goodpasture综合征', 'Goodpasture综合征', '肺炎', '过敏性肺炎', '诺沃克类病毒胃肠炎', '肺放线菌病', '肺炎球菌肺炎', '肺水肿', '非典', '成人呼吸窘迫综合征', '肺曲菌病', '肺炎杆菌肺炎', '肺念珠菌病']
doctor = ['陈涛','凌至培','俞文华','赵英','姚鹏','岳剑宁','王林','凌地洋','孙基栋','马凯','李乃忠','朱国行','骆纯','郑拥军','张学亮','孙德利','洪波','方侃','吴育彬','黄立安','马卫东','刘建','朱成全','吴文','黄旭明','刁丽梅','劳诚毅','黄进瑜','黄选华','邱小鹰','李雪斌','王东','胡新华','王先锋','张元兴','陈应柱','杨明华','葛许华','唐维国','雒仁玺','孙云廷','卢振中','黄冰','李顺','刘子贵','梁启胜','金珊','黄辉','任明山','陈幸生','周志明','薛义成','徐仁伵','熊英琼','刘李斌','骆锦昆','罗新明','张齐龙','熊俊','雷惠新','吴白甫','王宏梗','王晓健','穆军山','林建新','林献忠','万红棉','苏秀贞','孙远标','王树华','刘广存','陈腾','曹元成','杨谦','王占尧','贾栋','安鹏','杨建辉','杨志宏','李文涛','杨立波','尹港峰','袁栋才','郭艳敏','雷国亮','肖丽萍','冯国强','郑伟锋','李湘云','任德启','张东锋','马松鹤','张建国','李柱','马文庭','刘振林','布茂振','徐豫珏','于炎冰','石玉生',
]

# for d in dataset:
#     for q in disease_drug:
#         q = q.replace("$",d)
#         res += q
#
# for d in dataset[500:800]:
#     for q in disease_desc:
#         q = q.replace("$",d)
#         res += q

# for d in doctor:
#     for q in ask_how_doctor:
#         q = q.replace("$",d)
#         res += q

# for d in dataset[500:800]:
#     for q in disease_symptom[-3:]:
#         q = q.replace("$",d)
#         res += q

for d in dataset[500:800]:
    for q in recommend_doctor[-1]:
        q = q.replace("$",d)
        res += q

# for d in dataset[500:800]:
#     for q in disease_cause[-1]:
#         q = q.replace("$",d)
#         res += q
#
# for d in dataset[500:800]:
#     for q in disease_acompany:
#         q = q.replace("$",d)
#         res += q


# for d in dataset[600:900]:
#     for q in disease_not_food:
#         q = q.replace("$",d)
#         res += q

# for d in dataset[600:900]:
#     for q in disease_prevent:
#         q = q.replace("$",d)
#         res += q

# for d in dataset[600:900]:
#     for q in disease_do_food[-1]:
#         q = q.replace("$",d)
#         res += q


# for d in dataset[600:900]:
#     for q in disease_check:
#         q = q.replace("$",d)
#         res += q

# for d in dataset[500:700]:
#     for q in disease_easyget:
#         q = q.replace("$",d)
#         res += q

# for d in dataset[500:700]:
#     for q in disease_cureprob:
#         q = q.replace("$",d)
#         res += q
#

# for d in dataset[500:700]:
#     for q in disease_cureway[-2:]:
#         q = q.replace("$", d)
#         res += q

print(res)

